-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2015-09-29 17:19:52
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `course`
--

-- --------------------------------------------------------

--
-- 表的结构 `2015cs_course`
--

CREATE TABLE IF NOT EXISTS `2015cs_course` (
  `course_id` int(4) NOT NULL,
  `level` int(8) DEFAULT NULL,
  `major` text CHARACTER SET utf8,
  `number` int(8) DEFAULT NULL,
  `course_name` text CHARACTER SET utf8,
  `choise_type` text CHARACTER SET utf8,
  `credit` int(4) DEFAULT NULL,
  `class_hour` int(8) DEFAULT NULL,
  `sy_hour` text CHARACTER SET utf8,
  `sj_hour` text CHARACTER SET utf8,
  `from_to` text CHARACTER SET utf8,
  `teacher_name` text CHARACTER SET utf8,
  `remark` text CHARACTER SET utf8,
  PRIMARY KEY (`course_id`)
) ENGINE=InnoDB DEFAULT CHARSET=gb2312;

--
-- 转存表中的数据 `2015cs_course`
--

INSERT INTO `2015cs_course` (`course_id`, `level`, `major`, `number`, `course_name`, `choise_type`, `credit`, `class_hour`, `sy_hour`, `sj_hour`, `from_to`, `teacher_name`, `remark`) VALUES
(201501, 2012, '计算机科学与技术', 87, ' Internet技术与协议分析实验', '  实践选修', 1, 24, '', '', '', '', ''),
(201502, 2012, '计算机科学与技术', 87, ' IT企业项目实训', '  实践选修', 2, 48, '', '', '', '', ''),
(201503, 2012, '计算机科学与技术', 87, ' 多媒体通信技术', '  专业选修', 2, 32, '', '', '', '', ''),
(201504, 2012, '计算机科学与技术', 87, ' 分布式操作系统', '  专业选修', 2, 32, '', '', '', '', ''),
(201505, 2012, '计算机科学与技术', 87, ' 分布式系统', '  专业选修', 2, 32, '', '', '', '', ''),
(201506, 2012, '计算机科学与技术', 87, ' 广域网技术实验', '  实践选修', 1, 24, '', '', '', '', ''),
(201507, 2012, '计算机科学与技术', 87, ' 计算机仿真技术', '  专业选修', 2, 32, '12', '', '', '', ''),
(201508, 2012, '计算机科学与技术', 87, ' 计算机外部设备', '  专业选修', 2, 32, '', '', '', '', ''),
(201509, 2012, '计算机科学与技术', 87, ' 软件可靠性与可信软件', '  专业选修', 2, 32, '', '', '', '', ''),
(201510, 2012, '计算机科学与技术', 87, ' 网络工程应用开发技术', '  专业选修', 2, 32, '', '', '', '', ''),
(201511, 2012, '计算机科学与技术', 87, ' 云计算', '  专业选修', 2, 32, '', '', '', '', ''),
(201512, 2013, '计算机科学与技术', 1, ' EDA技术', '  专业方向（限选）1', 2, 32, '', '16', '', '', ''),
(201513, 2013, '计算机科学与技术', 1, ' Java语言程序设计', '  实践选修', 2, 36, '', '18', '', '', ''),
(201514, 2013, '计算机科学与技术', 1, ' Linux操作系统设计实践', '  实践选修', 2, 36, '', '', '', '', ''),
(201515, 2013, '计算机科学与技术', 1, ' Web程序设计', '  专业方向（限选）2', 2, 32, '', '8', '', '', ''),
(201516, 2013, '计算机科学与技术', 1, ' 编译方法', '  学科必修', 3, 48, '', '', '', '', ''),
(201517, 2013, '计算机科学与技术', 1, ' 编译系统设计实践', '  实践选修', 2, 36, '', '', '', '', ''),
(201518, 2013, '计算机科学与技术', 1, ' 计算方法', '  学科必修', 2, 32, '', '', '', '', ''),
(201519, 2013, '计算机科学与技术', 1, ' 计算机图形学', '  专业方向（限选）3', 2, 32, '', '', '', '', ''),
(201520, 2013, '计算机科学与技术', 1, ' 计算机图形学综合实验', '  实践选修', 2, 36, '', '', '', '', ''),
(201521, 2013, '计算机科学与技术', 1, ' 计算机网络体系结构', '  专业方向（限选）1', 2, 32, '', '', '', '', ''),
(201522, 2013, '计算机科学与技术', 1, ' 计算机系统结构', '  学科必修', 3, 48, '', '', '', '', ''),
(201523, 2013, '计算机科学与技术', 1, ' 宽带网及宽带接入技术', '  专业选修', 2, 32, '', '', '', '', ''),
(201524, 2013, '计算机科学与技术', 1, ' 面向对象设计方法(UML)', '  专业方向（限选）2', 2, 32, '', '', '', '', ''),
(201525, 2013, '计算机科学与技术', 1, ' 人工智能', '  专业必修（限选）', 2, 32, '', '', '', '', ''),
(201526, 2013, '计算机科学与技术', 1, ' 软件工程A', '  专业必修（限选）', 3, 48, '', '', '', '', ''),
(201527, 2013, '计算机科学与技术', 1, ' 软件工程实践', '  实践选修', 2, 48, '', '', '', '', ''),
(201528, 2013, '计算机科学与技术', 1, ' 软件体系结构', '  专业方向（限选）2', 2, 32, '', '', '', '', ''),
(201529, 2013, '计算机科学与技术', 1, ' 数据挖掘技术', '  专业方向（限选）3', 2, 32, '', '', '', '', ''),
(201530, 2013, '计算机科学与技术', 1, ' 现代计算机接口技术', '  专业必修（限选）', 2, 32, '', '', '', '', ''),
(201531, 2013, '计算机科学与技术', 1, ' 现代计算机接口技术实践', '  实践选修', 2, 36, '', '', '', '', ''),
(201532, 2013, '计算机科学与技术', 1, ' 现代搜索引擎技术及应用', '  专业选修', 2, 32, '', '', '', '', ''),
(201533, 2014, '计算机类', 191, ' IEEE Micromouse 原理与实践B（企业开课）', '  专业选修', 2, 32, '16', '', '', '', ''),
(201534, 2014, '计算机类', 191, ' 离散数学A', '  学科必修', 5, 72, '', '', '', '', ''),
(201535, 2014, '计算机类', 191, ' 数字电路与逻辑设计', '  学科必修', 3, 48, '', '', '', '', ''),
(201536, 2014, '计算机类', 191, ' 数字逻辑电路设计', '  实践选修', 2, 48, '', '', '', '', ''),
(201537, 2014, '计算机类', 191, ' 算法与数据结构', '  学科必修', 5, 80, '', '28', '', '', ''),
(201538, 2015, '计算机类', 1, ' 高级语言程序设计', '  学科必修', 4, 64, '', '32', '', '', ''),
(201539, 2015, '计算机类', 1, ' 计算机导论', '  学科必修', 2, 24, '', '', '', '', ''),
(201540, 2015, '计算机类', 1, ' 认识实习（计算机基础训练）', '  实践环节', 1, 24, '', '', '', '', ''),
(201541, 2015, '计算机类', 1, ' 线性代数', '  公共必修', 2, 32, '', '', '', '', '');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
